Revit 2027 API
ExternalDataManagerCommand.Tooltip Property
 The tooltip of the command.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Tooltip { get; set; }
Public Property Tooltip As String
	Get
	Set
public:
property String^ Tooltip {
	String^ get ();
	void set (String^ value);
}
member Tooltip : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 The tooltip will be shown in UI, so it should be localized.
See Also
Reference
ExternalDataManagerCommand Class
Autodesk.Revit.UI Namespace